let html =
  `
<div class="wrapper">
        <div class="btn bold" style="background: none;">𝗕</div>
        <div class="btn italic" style="background: none;">𝑰</div>
        <div class="btn underline" style="background: none;">U̲</div>
        <div class="btn strikeThrough" style="background: none;">S̶</div>
        <div class="btn cursive" style="background: none;">𝓒</div> 
        <div class="btn smallCaps" style="background: none;">Sᴍᴀʟʟ</div> 
        <div class="btn outline" style="background: none;">𝔽</div> 
        <div class="btn upsideDown" style="background: none;">∩</div> 
</div>    
</div>
`
$("body").arrive(`[aria-label="Post"]`, function (e) {
  $(e)
    .parent()
    .append(html)
});

const textFormatOption = (type) => {
  restoreSelection(selectedObj);
  if ($(`[aria-label="Post"]`).length) {
    var stringSelected = document.getSelection().toString();
    if (stringSelected) {
      var reformatedText = reformatIt(stringSelected, type);
      console.log(reformatedText);

      const blob = new Blob([reformatedText], {
        type: "text/plain",
      });
      let cpData = [
        new ClipboardItem({
          "text/plain": blob,
        }),
      ];

      navigator.clipboard.write(cpData).then(
        function () {
          restoreSelection(selectedObj);
          setTimeout(() => {
            document.execCommand("paste");
          }, 500);
          restoreSelection(selectedObj);
        },
        function (error) {
          console.error("Unable to paste the data. Error:");
          console.log(error);
        }
      );
    }
  }
};

$(document).on("click", ".bold", () => {
  if (document.getElementsByClassName("bold")[0].style.background === "none") {
    document.getElementsByClassName("bold")[0].style.background = "darkgray";
    textFormatOption(0)
  } else {
    document.getElementsByClassName("bold")[0].style.background = "none";
    textFormatOption(9)
  }
});

$(document).on("click", ".italic", () => {
  if (document.getElementsByClassName("italic")[0].style.background === "none") {
    document.getElementsByClassName("italic")[0].style.background = "darkgray";
    textFormatOption(1);
  } else {
    document.getElementsByClassName("italic")[0].style.background = "none";
    textFormatOption(9)
  }
});
$(document).on("click", ".strikeThrough", () => {
  if (document.getElementsByClassName("strikeThrough")[0].style.background === "none") {
    document.getElementsByClassName("strikeThrough")[0].style.background = "darkgray";
    textFormatOption(3);
  } else {
    document.getElementsByClassName("strikeThrough")[0].style.background = "none";
    textFormatOption(9)
  }
});
$(document).on("click", ".cursive", () => {
  if (document.getElementsByClassName("cursive")[0].style.background === "none") {
    document.getElementsByClassName("cursive")[0].style.background = "darkgray";
    textFormatOption(4);
  } else {
    document.getElementsByClassName("cursive")[0].style.background = "none";
    textFormatOption(9)
  }
});
$(document).on("click", ".upsideDown", () => {
  if (document.getElementsByClassName("upsideDown")[0].style.background === "none") {
    document.getElementsByClassName("upsideDown")[0].style.background = "darkgray";
    textFormatOption(5);
  } else {
    document.getElementsByClassName("upsideDown")[0].style.background = "none";
    textFormatOption(9)
  }
});
$(document).on("click", ".underline", () => {
  if (document.getElementsByClassName("underline")[0].style.background === "none") {
    document.getElementsByClassName("underline")[0].style.background = "darkgray";
    textFormatOption(6);
  } else {
    document.getElementsByClassName("underline")[0].style.background = "none";
    textFormatOption(9)
  }
});
$(document).on("click", ".outline", () => {
  if (document.getElementsByClassName("outline")[0].style.background === "none") {
    document.getElementsByClassName("outline")[0].style.background = "darkgray";
    textFormatOption(7);
  } else {
    document.getElementsByClassName("outline")[0].style.background = "none";
    textFormatOption(9)
  }
});
$(document).on("click", ".smallCaps", () => {
  if (document.getElementsByClassName("smallCaps")[0].style.background === "none") {
    document.getElementsByClassName("smallCaps")[0].style.background = "darkgray";
    textFormatOption(8);
  } else {
    document.getElementsByClassName("smallCaps")[0].style.background = "none";
    textFormatOption(9)
  }
});

function saveSelection() {
  if (window.getSelection) {
    sel = window.getSelection();
    if (sel.getRangeAt && sel.rangeCount) {
      return sel.getRangeAt(0);
    }
  } else if (document.selection && document.selection.createRange) {
    return document.selection.createRange();
  }
  return null;
}

function restoreSelection(range) {
  if (range) {
    if (window.getSelection) {
      sel = window.getSelection();
      sel.removeAllRanges();
      sel.addRange(range);
    } else if (document.selection && range.select) {
      range.select();
    }
  }
}

var selectedObj = "";

$(document).on("selectionchange", function (e) {
  if ($(`[aria-label="Post"]`).length) {
    var stringSelected = window.getSelection().toString();
    if (stringSelected) {
      selectedObj = saveSelection();
    }
  }
});

var charArray = [];
charArray["A"] = ["𝗔", "𝘈", "𝘼", "A̶", "𝒜", "∀", "A͟", "𝔸", "ᴀ", "A"];
charArray["B"] = ["𝗕", "𝘉", "𝘽", "B̶", "ℬ", "𐐒", "B͟", "𝔹", "ʙ", "B"];
charArray["C"] = ["𝗖", "𝘊", "𝘾", "C̶", "𝒞", "Ͻ", "C͟", "ℂ", "ᴄ", "C"];
charArray["D"] = ["𝗗", "𝘋", "𝘿", "D̶", "𝒟", "ᗡ", "D͟", "𝔻", "ᴅ", "D"];
charArray["E"] = ["𝗘", "𝘌", "𝙀", "E̶", "ℰ", "Ǝ", "E͟", "𝔼", "ᴇ", "E"];
charArray["F"] = ["𝗙", "𝘍", "𝙁", "F̶", "ℱ", "Ⅎ", "F͟", "𝔽", "ꜰ", "F"];
charArray["G"] = ["𝗚", "𝘎", "𝙂", "G̶", "𝒢", "⅁", "G͟", "𝔾", "ɢ", "G"];
charArray["H"] = ["𝗛", "𝘏", "𝙃", "H̶", "ℋ", "H", "H͟", "ℍ", "ʜ", "H"];
charArray["I"] = ["𝐈", "𝐼", "𝑰", "I̶", "ℐ", "I", "I͟", "𝕀", "ɪ", "I"];
charArray["J"] = ["𝗝", "𝘑", "𝙅", "J̶", "𝒥", "ſ", "J͟", "𝕁", "ᴊ", "J"];
charArray["K"] = ["𝗞", "𝘒", "𝙆", "K̶", "𝒦", "ꓘ", "K͟", "𝕂", "ᴋ", "K"];
charArray["L"] = ["𝗟", "𝘓", "𝙇", "L̶", "ℒ", "˥", "L͟", "𝕃", "ʟ", "L"];
charArray["M"] = ["𝗠", "𝘔", "𝙈", "M̶", "ℳ", "W", "M͟", "𝕄", "ᴍ", "M"];
charArray["N"] = ["𝗡", "𝘕", "𝙉", "N̶", "𝒩", "N", "N͟", "ℕ", "ɴ", "N"];
charArray["O"] = ["𝗢", "𝘖", "𝙊", "O̶", "𝒪", "O", "O͟", "𝕆", "ᴏ", "O"];
charArray["P"] = ["𝗣", "𝘗", "𝙋", "P̶", "𝒫", "Ԁ", "P͟", "ℙ", "ᴘ", "P"];
charArray["Q"] = ["𝗤", "𝘘", "𝙌", "Q̶", "𝒬", "Ὁ", "Q͟", "ℚ", "ǫ", "Q"];
charArray["R"] = ["𝗥", "𝘙", "𝙍", "R̶", "ℛ", "ᴚ", "R͟", "ℝ", "ʀ", "R"];
charArray["S"] = ["𝗦", "𝘚", "𝙎", "S̶", "𝒮", "S", "S͟", "𝕊", "s", "S"];
charArray["T"] = ["𝗧", "𝘛", "𝙏", "T̶", "𝒯", "⊥", "T͟", "𝕋", "ᴛ", "T"];
charArray["U"] = ["𝗨", "𝘜", "𝙐", "U̶", "𝒰", "∩", "U͟", "𝕌", "ᴜ", "U"];
charArray["V"] = ["𝗩", "𝘝", "𝙑", "V̶", "𝒱", "Λ", "V͟", "𝕍", "ᴠ", "V"];
charArray["W"] = ["𝗪", "𝘞", "𝙒", "W̶", "𝒲", "M", "W͟", "𝕎", "ᴡ", "W"];
charArray["X"] = ["𝗫", "𝘟", "𝙓", "X̶", "𝒳", "X", "X͟", "𝕏", "x", "X"];
charArray["Y"] = ["𝗬", "𝘠", "𝙔", "Y̶", "𝒴", "⅄", "Y͟", "𝕐", "ʏ", "Y"];
charArray["Z"] = ["𝗭", "𝘡", "𝙕", "Z̶", "𝒵", "Z", "Z͟", "ℤ", "ᴢ", "Z"];
charArray["a"] = ["𝗮", "𝘢", "𝙖", "a̶", "𝒶", "ɐ", "a͟", "𝕒", "ᴀ", "a"];
charArray["b"] = ["𝗯", "𝘣", "𝙗", "b̶", "𝒷", "q", "b͟", "𝕓", "ʙ", "b"];
charArray["c"] = ["𝗰", "𝘤", "𝙘", "c̶", "𝒸", "ɔ", "c͟", "𝕔", "ᴄ", "c"];
charArray["d"] = ["𝗱", "𝘥", "𝙙", "d̶", "𝒹", "p", "d͟", "𝕕", "ᴅ", "d"];
charArray["e"] = ["𝗲", "𝘦", "𝙚", "e̶", "ℯ", "ǝ", "e͟", "𝕖", "ᴇ", "e"];
charArray["f"] = ["𝗳", "𝘧", "𝙛", "f̶", "𝒻", "ɟ", "f͟", "𝕗", "ꜰ", "f"];
charArray["g"] = ["𝗴", "𝘨", "𝙜", "g̶", "ℊ", "ƃ", "g͟", "𝕘", "ɢ", "g"];
charArray["h"] = ["𝗵", "𝘩", "𝙝", "h̶", "𝒽", "ɥ", "h͟", "𝕙", "ʜ", "h"];
charArray["i"] = ["𝗶", "𝘪", "𝙞", "i̶", "𝒾", "ı", "i͟", "𝕚", "ɪ", "i"];
charArray["j"] = ["𝗷", "𝘫", "𝙟", "j̶", "𝒿", "ɾ", "j͟", "𝕛", "ᴊ", "j"];
charArray["k"] = ["𝗸", "𝘬", "𝙠", "k̶", "𝓀", "ʞ", "k͟", "𝕜", "ᴋ", "k"];
charArray["l"] = ["𝗹", "𝘭", "𝙡", "l̶", "𝓁", "ן", "l͟", "𝕝", "ʟ", "l"];
charArray["m"] = ["𝗺", "𝘮", "𝙢", "m̶", "𝓂", "ɯ", "m͟", "𝕞", "ᴍ", "m"];
charArray["n"] = ["𝗻", "𝘯", "𝙣", "n̶", "𝓃", "u", "n͟", "𝕟", "ɴ", "n"];
charArray["o"] = ["𝗼", "𝘰", "𝙤", "o̶", "ℴ", "o", "o͟", "𝕠", "ᴏ", "o"];
charArray["p"] = ["𝗽", "𝘱", "𝙥", "p̶", "𝓅", "d", "p͟", "𝕡", "ᴘ", "p"];
charArray["q"] = ["𝗾", "𝘲", "𝙦", "q̶", "𝓆", "b", "q͟", "𝕢", "ǫ", "q"];
charArray["r"] = ["𝗿", "𝘳", "𝙧", "r̶", "𝓇", "ɹ", "r͟", "𝕣", "ʀ", "r"];
charArray["s"] = ["𝘀", "𝘴", "𝙨", "s̶", "𝓈", "s", "s͟", "𝕤", "s", "s"];
charArray["t"] = ["𝘁", "𝘵", "𝙩", "t̶", "𝓉", "ʇ", "t͟", "𝕥", "ᴛ", "t"];
charArray["u"] = ["𝘂", "𝘶", "𝙪", "u̶", "𝓊", "n", "u͟", "𝕦", "ᴜ", "u"];
charArray["v"] = ["𝘃", "𝘷", "𝙫", "v̶", "𝓋", "ʌ", "v͟", "𝕧", "ᴠ", "v"];
charArray["w"] = ["𝘄", "𝘸", "𝙬", "w̶", "𝓌", "ʍ", "w͟", "𝕨", "ᴡ", "w"];
charArray["x"] = ["𝘅", "𝘹", "𝙭", "x̶", "𝓍", "x", "x͟", "𝕩", "x", "x"];
charArray["y"] = ["𝘆", "𝘺", "𝙮", "y̶", "𝓎", "ʎ", "y͟", "𝕪", "ʏ", "y"];
charArray["z"] = ["𝘇", "𝘻", "𝙯", "z̶", "𝓏", "z", "z͟", "𝕫", "ᴢ", "z"];
charArray["1"] = ["𝟭", "1", "𝟭", "1̶", "1", "⇂", "1͟", "𝟙", "1", "1"];
charArray["2"] = ["𝟮", "2", "𝟮", "2̶", "2", "↊", "2͟", "𝟚", "2", "2"];
charArray["3"] = ["𝟯", "3", "𝟯", "3̶", "3", "↋", "3͟", "𝟛", "3", "3"];
charArray["4"] = ["𝟰", "4", "𝟰", "4̶", "4", "4", "4͟", "𝟜", "4", "4"];
charArray["5"] = ["𝟱", "5", "𝟱", "5̶", "5", "5", "5͟", "𝟝", "5", "5"];
charArray["6"] = ["𝟲", "6", "𝟲", "6̶", "6", "9", "6͟", "𝟞", "6", "6"];
charArray["7"] = ["𝟳", "7", "𝟳", "7̶", "7", "𝘓", "7͟", "𝟟", "7", "7"];
charArray["8"] = ["𝟴", "8", "𝟴", "8̶", "8", "8", "8͟", "𝟠", "8", "8"];
charArray["9"] = ["𝟵", "9", "𝟵", "9̶", "9", "6", "9͟", "𝟡", "9", "9"];
charArray["0"] = ["𝟬", "0", "𝟬", "0̶", "0", "0", "0͟", "𝟘", "0", "0"];

charArray["𝗔"] = ["𝗔", "𝘈", "𝘼", "A̶", "𝒜", "∀", "A͟", "𝔸", "ᴀ", "A"];
charArray["𝗕"] = ["𝗕", "𝘉", "𝘽", "B̶", "ℬ", "𐐒", "B͟", "𝔹", "ʙ", "B"];
charArray["𝗖"] = ["𝗖", "𝘊", "𝘾", "C̶", "𝒞", "Ͻ", "C͟", "ℂ", "ᴄ", "C"];
charArray["𝗗"] = ["𝗗", "𝘋", "𝘿", "D̶", "𝒟", "ᗡ", "D͟", "𝔻", "ᴅ", "D"];
charArray["𝗘"] = ["𝗘", "𝘌", "𝙀", "E̶", "ℰ", "Ǝ", "E͟", "𝔼", "ᴇ", "E"];
charArray["𝗙"] = ["𝗙", "𝘍", "𝙁", "F̶", "ℱ", "Ⅎ", "F͟", "𝔽", "ꜰ", "F"];
charArray["𝗚"] = ["𝗚", "𝘎", "𝙂", "G̶", "𝒢", "⅁", "G͟", "𝔾", "ɢ", "G"];
charArray["𝗛"] = ["𝗛", "𝘏", "𝙃", "H̶", "ℋ", "H", "H͟", "ℍ", "ʜ", "H"];
charArray["𝗜"] = ["𝐈", "𝐼", "𝑰", "I̶", "ℐ", "I", "I͟", "𝕀", "ɪ", "I"];
charArray["𝗝"] = ["𝗝", "𝘑", "𝙅", "J̶", "𝒥", "ſ", "J͟", "𝕁", "ᴊ", "J"];
charArray["𝗞"] = ["𝗞", "𝘒", "𝙆", "K̶", "𝒦", "ꓘ", "K͟", "𝕂", "ᴋ", "K"];
charArray["𝗟"] = ["𝗟", "𝘓", "𝙇", "L̶", "ℒ", "˥", "L͟", "𝕃", "ʟ", "L"];
charArray["𝗠"] = ["𝗠", "𝘔", "𝙈", "M̶", "ℳ", "W", "M͟", "𝕄", "ᴍ", "M"];
charArray["𝗡"] = ["𝗡", "𝘕", "𝙉", "N̶", "𝒩", "N", "N͟", "ℕ", "ɴ", "N"];
charArray["𝗢"] = ["𝗢", "𝘖", "𝙊", "O̶", "𝒪", "O", "O͟", "𝕆", "ᴏ", "O"];
charArray["𝗣"] = ["𝗣", "𝘗", "𝙋", "P̶", "𝒫", "Ԁ", "P͟", "ℙ", "ᴘ", "P"];
charArray["𝗤"] = ["𝗤", "𝘘", "𝙌", "Q̶", "𝒬", "Ὁ", "Q͟", "ℚ", "ǫ", "Q"];
charArray["𝗥"] = ["𝗥", "𝘙", "𝙍", "R̶", "ℛ", "ᴚ", "R͟", "ℝ", "ʀ", "R"];
charArray["𝗦"] = ["𝗦", "𝘚", "𝙎", "S̶", "𝒮", "S", "S͟", "𝕊", "s", "S"];
charArray["𝗧"] = ["𝗧", "𝘛", "𝙏", "T̶", "𝒯", "⊥", "T͟", "𝕋", "ᴛ", "T"];
charArray["𝗨"] = ["𝗨", "𝘜", "𝙐", "U̶", "𝒰", "∩", "U͟", "𝕌", "ᴜ", "U"];
charArray["𝗩"] = ["𝗩", "𝘝", "𝙑", "V̶", "𝒱", "Λ", "V͟", "𝕍", "ᴠ", "V"];
charArray["𝗪"] = ["𝗪", "𝘞", "𝙒", "W̶", "𝒲", "M", "W͟", "𝕎", "ᴡ", "W"];
charArray["𝗫"] = ["𝗫", "𝘟", "𝙓", "X̶", "𝒳", "X", "X͟", "𝕏", "x", "X"];
charArray["𝗬"] = ["𝗬", "𝘠", "𝙔", "Y̶", "𝒴", "⅄", "Y͟", "𝕐", "ʏ", "Y"];
charArray["𝗭"] = ["𝗭", "𝘡", "𝙕", "Z̶", "𝒵", "Z", "Z͟", "ℤ", "ᴢ", "Z"];
charArray["𝗮"] = ["𝗮", "𝘢", "𝙖", "a̶", "𝒶", "ɐ", "a͟", "𝕒", "ᴀ", "a"];
charArray["𝗯"] = ["𝗯", "𝘣", "𝙗", "b̶", "𝒷", "q", "b͟", "𝕓", "ʙ", "b"];
charArray["𝗰"] = ["𝗰", "𝘤", "𝙘", "c̶", "𝒸", "ɔ", "c͟", "𝕔", "ᴄ", "c"];
charArray["𝗱"] = ["𝗱", "𝘥", "𝙙", "d̶", "𝒹", "p", "d͟", "𝕕", "ᴅ", "d"];
charArray["𝗲"] = ["𝗲", "𝘦", "𝙚", "e̶", "ℯ", "ǝ", "e͟", "𝕖", "ᴇ", "e"];
charArray["𝗳"] = ["𝗳", "𝘧", "𝙛", "f̶", "𝒻", "ɟ", "f͟", "𝕗", "ꜰ", "f"];
charArray["𝗴"] = ["𝗴", "𝘨", "𝙜", "g̶", "ℊ", "ƃ", "g͟", "𝕘", "ɢ", "g"];
charArray["𝗵"] = ["𝗵", "𝘩", "𝙝", "h̶", "𝒽", "ɥ", "h͟", "𝕙", "ʜ", "h"];
charArray["𝗶"] = ["𝗶", "𝘪", "𝙞", "i̶", "𝒾", "ı", "i͟", "𝕚", "ɪ", "i"];
charArray["𝗷"] = ["𝗷", "𝘫", "𝙟", "j̶", "𝒿", "ɾ", "j͟", "𝕛", "ᴊ", "j"];
charArray["𝗸"] = ["𝗸", "𝘬", "𝙠", "k̶", "𝓀", "ʞ", "k͟", "𝕜", "ᴋ", "k"];
charArray["𝗹"] = ["𝗹", "𝘭", "𝙡", "l̶", "𝓁", "ן", "l͟", "𝕝", "ʟ", "l"];
charArray["𝗺"] = ["𝗺", "𝘮", "𝙢", "m̶", "𝓂", "ɯ", "m͟", "𝕞", "ᴍ", "m"];
charArray["𝗻"] = ["𝗻", "𝘯", "𝙣", "n̶", "𝓃", "u", "n͟", "𝕟", "ɴ", "n"];
charArray["𝗼"] = ["𝗼", "𝘰", "𝙤", "o̶", "ℴ", "o", "o͟", "𝕠", "ᴏ", "o"];
charArray["𝗽"] = ["𝗽", "𝘱", "𝙥", "p̶", "𝓅", "d", "p͟", "𝕡", "ᴘ", "p"];
charArray["𝗾"] = ["𝗾", "𝘲", "𝙦", "q̶", "𝓆", "b", "q͟", "𝕢", "ǫ", "q"];
charArray["𝗿"] = ["𝗿", "𝘳", "𝙧", "r̶", "𝓇", "ɹ", "r͟", "𝕣", "ʀ", "r"];
charArray["𝘀"] = ["𝘀", "𝘴", "𝙨", "s̶", "𝓈", "s", "s͟", "𝕤", "s", "s"];
charArray["𝘁"] = ["𝘁", "𝘵", "𝙩", "t̶", "𝓉", "ʇ", "t͟", "𝕥", "ᴛ", "t"];
charArray["𝘂"] = ["𝘂", "𝘶", "𝙪", "u̶", "𝓊", "n", "u͟", "𝕦", "ᴜ", "u"];
charArray["𝘃"] = ["𝘃", "𝘷", "𝙫", "v̶", "𝓋", "ʌ", "v͟", "𝕧", "ᴠ", "v"];
charArray["𝘄"] = ["𝘄", "𝘸", "𝙬", "w̶", "𝓌", "ʍ", "w͟", "𝕨", "ᴡ", "w"];
charArray["𝘅"] = ["𝘅", "𝘹", "𝙭", "x̶", "𝓍", "x", "x͟", "𝕩", "x", "x"];
charArray["𝘆"] = ["𝘆", "𝘺", "𝙮", "y̶", "𝓎", "ʎ", "y͟", "𝕪", "ʏ", "y"];
charArray["𝘇"] = ["𝘇", "𝘻", "𝙯", "z̶", "𝓏", "z", "z͟", "𝕫", "ᴢ", "z"];
charArray["𝟭"] = ["𝟭", "1", "𝟭", "1̶", "1", "⇂", "1͟", "𝟙", "1", "1"];
charArray["𝟮"] = ["𝟮", "2", "𝟮", "2̶", "2", "↊", "2͟", "𝟚", "2", "2"];
charArray["𝟯"] = ["𝟯", "3", "𝟯", "3̶", "3", "↋", "3͟", "𝟛", "3", "3"];
charArray["𝟰"] = ["𝟰", "4", "𝟰", "4̶", "4", "4", "4͟", "𝟜", "4", "4"];
charArray["𝟱"] = ["𝟱", "5", "𝟱", "5̶", "5", "5", "5͟", "𝟝", "5", "5"];
charArray["𝟲"] = ["𝟲", "6", "𝟲", "6̶", "6", "9", "6͟", "𝟞", "6", "6"];
charArray["𝟳"] = ["𝟳", "7", "𝟳", "7̶", "7", "𝘓", "7͟", "𝟟", "7", "7"];
charArray["𝟴"] = ["𝟴", "8", "𝟴", "8̶", "8", "8", "8͟", "𝟠", "8", "8"];
charArray["𝟵"] = ["𝟵", "9", "𝟵", "9̶", "9", "6", "9͟", "𝟡", "9", "9"];
charArray["𝟬"] = ["𝟬", "0", "𝟬", "0̶", "0", "0", "0͟", "𝟘", "0", "0"];

charArray["𝘈"] = ["𝗔", "𝘈", "𝘼", "A̶", "𝒜", "∀", "A͟", "𝔸", "ᴀ", "A"];
charArray["𝘉"] = ["𝗕", "𝘉", "𝘽", "B̶", "ℬ", "𐐒", "B͟", "𝔹", "ʙ", "B"];
charArray["𝘊"] = ["𝗖", "𝘊", "𝘾", "C̶", "𝒞", "Ͻ", "C͟", "ℂ", "ᴄ", "C"];
charArray["𝘋"] = ["𝗗", "𝘋", "𝘿", "D̶", "𝒟", "ᗡ", "D͟", "𝔻", "ᴅ", "D"];
charArray["𝘌"] = ["𝗘", "𝘌", "𝙀", "E̶", "ℰ", "Ǝ", "E͟", "𝔼", "ᴇ", "E"];
charArray["𝘍"] = ["𝗙", "𝘍", "𝙁", "F̶", "ℱ", "Ⅎ", "F͟", "𝔽", "ꜰ", "F"];
charArray["𝘎"] = ["𝗚", "𝘎", "𝙂", "G̶", "𝒢", "⅁", "G͟", "𝔾", "ɢ", "G"];
charArray["𝘏"] = ["𝗛", "𝘏", "𝙃", "H̶", "ℋ", "H", "H͟", "ℍ", "ʜ", "H"];
charArray["𝘐"] = ["𝐈", "𝐼", "𝑰", "I̶", "ℐ", "I", "I͟", "𝕀", "ɪ", "I"];
charArray["𝘑"] = ["𝗝", "𝘑", "𝙅", "J̶", "𝒥", "ſ", "J͟", "𝕁", "ᴊ", "J"];
charArray["𝘒"] = ["𝗞", "𝘒", "𝙆", "K̶", "𝒦", "ꓘ", "K͟", "𝕂", "ᴋ", "K"];
charArray["𝘓"] = ["𝗟", "𝘓", "𝙇", "L̶", "ℒ", "˥", "L͟", "𝕃", "ʟ", "L"];
charArray["𝘔"] = ["𝗠", "𝘔", "𝙈", "M̶", "ℳ", "W", "M͟", "𝕄", "ᴍ", "M"];
charArray["𝘕"] = ["𝗡", "𝘕", "𝙉", "N̶", "𝒩", "N", "N͟", "ℕ", "ɴ", "N"];
charArray["𝘖"] = ["𝗢", "𝘖", "𝙊", "O̶", "𝒪", "O", "O͟", "𝕆", "ᴏ", "O"];
charArray["𝘗"] = ["𝗣", "𝘗", "𝙋", "P̶", "𝒫", "Ԁ", "P͟", "ℙ", "ᴘ", "P"];
charArray["𝘘"] = ["𝗤", "𝘘", "𝙌", "Q̶", "𝒬", "Ὁ", "Q͟", "ℚ", "ǫ", "Q"];
charArray["𝘙"] = ["𝗥", "𝘙", "𝙍", "R̶", "ℛ", "ᴚ", "R͟", "ℝ", "ʀ", "R"];
charArray["𝘚"] = ["𝗦", "𝘚", "𝙎", "S̶", "𝒮", "S", "S͟", "𝕊", "s", "S"];
charArray["𝘛"] = ["𝗧", "𝘛", "𝙏", "T̶", "𝒯", "⊥", "T͟", "𝕋", "ᴛ", "T"];
charArray["𝘜"] = ["𝗨", "𝘜", "𝙐", "U̶", "𝒰", "∩", "U͟", "𝕌", "ᴜ", "U"];
charArray["𝘝"] = ["𝗩", "𝘝", "𝙑", "V̶", "𝒱", "Λ", "V͟", "𝕍", "ᴠ", "V"];
charArray["𝘞"] = ["𝗪", "𝘞", "𝙒", "W̶", "𝒲", "M", "W͟", "𝕎", "ᴡ", "W"];
charArray["𝘟"] = ["𝗫", "𝘟", "𝙓", "X̶", "𝒳", "X", "X͟", "𝕏", "x", "X"];
charArray["𝘠"] = ["𝗬", "𝘠", "𝙔", "Y̶", "𝒴", "⅄", "Y͟", "𝕐", "ʏ", "Y"];
charArray["𝘡"] = ["𝗭", "𝘡", "𝙕", "Z̶", "𝒵", "Z", "Z͟", "ℤ", "ᴢ", "Z"];
charArray["𝘢"] = ["𝗮", "𝘢", "𝙖", "a̶", "𝒶", "ɐ", "a͟", "𝕒", "ᴀ", "a"];
charArray["𝘣"] = ["𝗯", "𝘣", "𝙗", "b̶", "𝒷", "q", "b͟", "𝕓", "ʙ", "b"];
charArray["𝘤"] = ["𝗰", "𝘤", "𝙘", "c̶", "𝒸", "ɔ", "c͟", "𝕔", "ᴄ", "c"];
charArray["𝘥"] = ["𝗱", "𝘥", "𝙙", "d̶", "𝒹", "p", "d͟", "𝕕", "ᴅ", "d"];
charArray["𝘦"] = ["𝗲", "𝘦", "𝙚", "e̶", "ℯ", "ǝ", "e͟", "𝕖", "ᴇ", "e"];
charArray["𝘧"] = ["𝗳", "𝘧", "𝙛", "f̶", "𝒻", "ɟ", "f͟", "𝕗", "ꜰ", "f"];
charArray["𝘨"] = ["𝗴", "𝘨", "𝙜", "g̶", "ℊ", "ƃ", "g͟", "𝕘", "ɢ", "g"];
charArray["𝘩"] = ["𝗵", "𝘩", "𝙝", "h̶", "𝒽", "ɥ", "h͟", "𝕙", "ʜ", "h"];
charArray["𝘪"] = ["𝗶", "𝘪", "𝙞", "i̶", "𝒾", "ı", "i͟", "𝕚", "ɪ", "i"];
charArray["𝘫"] = ["𝗷", "𝘫", "𝙟", "j̶", "𝒿", "ɾ", "j͟", "𝕛", "ᴊ", "j"];
charArray["𝘬"] = ["𝗸", "𝘬", "𝙠", "k̶", "𝓀", "ʞ", "k͟", "𝕜", "ᴋ", "k"];
charArray["𝘭"] = ["𝗹", "𝘭", "𝙡", "l̶", "𝓁", "ן", "l͟", "𝕝", "ʟ", "l"];
charArray["𝘮"] = ["𝗺", "𝘮", "𝙢", "m̶", "𝓂", "ɯ", "m͟", "𝕞", "ᴍ", "m"];
charArray["𝘯"] = ["𝗻", "𝘯", "𝙣", "n̶", "𝓃", "u", "n͟", "𝕟", "ɴ", "n"];
charArray["𝘰"] = ["𝗼", "𝘰", "𝙤", "o̶", "ℴ", "o", "o͟", "𝕠", "ᴏ", "o"];
charArray["𝘱"] = ["𝗽", "𝘱", "𝙥", "p̶", "𝓅", "d", "p͟", "𝕡", "ᴘ", "p"];
charArray["𝘲"] = ["𝗾", "𝘲", "𝙦", "q̶", "𝓆", "b", "q͟", "𝕢", "ǫ", "q"];
charArray["𝘳"] = ["𝗿", "𝘳", "𝙧", "r̶", "𝓇", "ɹ", "r͟", "𝕣", "ʀ", "r"];
charArray["𝘴"] = ["𝘀", "𝘴", "𝙨", "s̶", "𝓈", "s", "s͟", "𝕤", "s", "s"];
charArray["𝘵"] = ["𝘁", "𝘵", "𝙩", "t̶", "𝓉", "ʇ", "t͟", "𝕥", "ᴛ", "t"];
charArray["𝘶"] = ["𝘂", "𝘶", "𝙪", "u̶", "𝓊", "n", "u͟", "𝕦", "ᴜ", "u"];
charArray["𝘷"] = ["𝘃", "𝘷", "𝙫", "v̶", "𝓋", "ʌ", "v͟", "𝕧", "ᴠ", "v"];
charArray["𝘸"] = ["𝘄", "𝘸", "𝙬", "w̶", "𝓌", "ʍ", "w͟", "𝕨", "ᴡ", "w"];
charArray["𝘹"] = ["𝘅", "𝘹", "𝙭", "x̶", "𝓍", "x", "x͟", "𝕩", "x", "x"];
charArray["𝘺"] = ["𝘆", "𝘺", "𝙮", "y̶", "𝓎", "ʎ", "y͟", "𝕪", "ʏ", "y"];
charArray["𝘻"] = ["𝘇", "𝘻", "𝙯", "z̶", "𝓏", "z", "z͟", "𝕫", "ᴢ", "z"];

charArray["A̶"] = ["𝗔", "𝘈", "𝘼", "A̶", "𝒜", "∀", "A͟", "𝔸", "ᴀ", "A"];
charArray["B̶"] = ["𝗕", "𝘉", "𝘽", "B̶", "ℬ", "𐐒", "B͟", "𝔹", "ʙ", "B"];
charArray["C̶"] = ["𝗖", "𝘊", "𝘾", "C̶", "𝒞", "Ͻ", "C͟", "ℂ", "ᴄ", "C"];
charArray["D̶"] = ["𝗗", "𝘋", "𝘿", "D̶", "𝒟", "ᗡ", "D͟", "𝔻", "ᴅ", "D"];
charArray["E̶"] = ["𝗘", "𝘌", "𝙀", "E̶", "ℰ", "Ǝ", "E͟", "𝔼", "ᴇ", "E"];
charArray["F̶"] = ["𝗙", "𝘍", "𝙁", "F̶", "ℱ", "Ⅎ", "F͟", "𝔽", "ꜰ", "F"];
charArray["G̶"] = ["𝗚", "𝘎", "𝙂", "G̶", "𝒢", "⅁", "G͟", "𝔾", "ɢ", "G"];
charArray["H̶"] = ["𝗛", "𝘏", "𝙃", "H̶", "ℋ", "H", "H͟", "ℍ", "ʜ", "H"];
charArray["I̶"] = ["𝐈", "𝐼", "𝑰", "I̶", "ℐ", "I", "I͟", "𝕀", "ɪ", "I"];
charArray["J̶"] = ["𝗝", "𝘑", "𝙅", "J̶", "𝒥", "ſ", "J͟", "𝕁", "ᴊ", "J"];
charArray["K̶"] = ["𝗞", "𝘒", "𝙆", "K̶", "𝒦", "ꓘ", "K͟", "𝕂", "ᴋ", "K"];
charArray["L̶"] = ["𝗟", "𝘓", "𝙇", "L̶", "ℒ", "˥", "L͟", "𝕃", "ʟ", "L"];
charArray["M̶"] = ["𝗠", "𝘔", "𝙈", "M̶", "ℳ", "W", "M͟", "𝕄", "ᴍ", "M"];
charArray["N̶"] = ["𝗡", "𝘕", "𝙉", "N̶", "𝒩", "N", "N͟", "ℕ", "ɴ", "N"];
charArray["O̶"] = ["𝗢", "𝘖", "𝙊", "O̶", "𝒪", "O", "O͟", "𝕆", "ᴏ", "O"];
charArray["P̶"] = ["𝗣", "𝘗", "𝙋", "P̶", "𝒫", "Ԁ", "P͟", "ℙ", "ᴘ", "P"];
charArray["Q̶"] = ["𝗤", "𝘘", "𝙌", "Q̶", "𝒬", "Ὁ", "Q͟", "ℚ", "ǫ", "Q"];
charArray["R̶"] = ["𝗥", "𝘙", "𝙍", "R̶", "ℛ", "ᴚ", "R͟", "ℝ", "ʀ", "R"];
charArray["S̶"] = ["𝗦", "𝘚", "𝙎", "S̶", "𝒮", "S", "S͟", "𝕊", "s", "S"];
charArray["T̶"] = ["𝗧", "𝘛", "𝙏", "T̶", "𝒯", "⊥", "T͟", "𝕋", "ᴛ", "T"];
charArray["U̶"] = ["𝗨", "𝘜", "𝙐", "U̶", "𝒰", "∩", "U͟", "𝕌", "ᴜ", "U"];
charArray["V̶"] = ["𝗩", "𝘝", "𝙑", "V̶", "𝒱", "Λ", "V͟", "𝕍", "ᴠ", "V"];
charArray["W̶"] = ["𝗪", "𝘞", "𝙒", "W̶", "𝒲", "M", "W͟", "𝕎", "ᴡ", "W"];
charArray["X̶"] = ["𝗫", "𝘟", "𝙓", "X̶", "𝒳", "X", "X͟", "𝕏", "x", "X"];
charArray["Y̶"] = ["𝗬", "𝘠", "𝙔", "Y̶", "𝒴", "⅄", "Y͟", "𝕐", "ʏ", "Y"];
charArray["Z̶"] = ["𝗭", "𝘡", "𝙕", "Z̶", "𝒵", "Z", "Z͟", "ℤ", "ᴢ", "Z"];
charArray["a̶"] = ["𝗮", "𝘢", "𝙖", "a̶", "𝒶", "ɐ", "a͟", "𝕒", "ᴀ", "a"];
charArray["b̶"] = ["𝗯", "𝘣", "𝙗", "b̶", "𝒷", "q", "b͟", "𝕓", "ʙ", "b"];
charArray["c̶"] = ["𝗰", "𝘤", "𝙘", "c̶", "𝒸", "ɔ", "c͟", "𝕔", "ᴄ", "c"];
charArray["d̶"] = ["𝗱", "𝘥", "𝙙", "d̶", "𝒹", "p", "d͟", "𝕕", "ᴅ", "d"];
charArray["e̶"] = ["𝗲", "𝘦", "𝙚", "e̶", "ℯ", "ǝ", "e͟", "𝕖", "ᴇ", "e"];
charArray["f̶"] = ["𝗳", "𝘧", "𝙛", "f̶", "𝒻", "ɟ", "f͟", "𝕗", "ꜰ", "f"];
charArray["g̶"] = ["𝗴", "𝘨", "𝙜", "g̶", "ℊ", "ƃ", "g͟", "𝕘", "ɢ", "g"];
charArray["h̶"] = ["𝗵", "𝘩", "𝙝", "h̶", "𝒽", "ɥ", "h͟", "𝕙", "ʜ", "h"];
charArray["i̶"] = ["𝗶", "𝘪", "𝙞", "i̶", "𝒾", "ı", "i͟", "𝕚", "ɪ", "i"];
charArray["j̶"] = ["𝗷", "𝘫", "𝙟", "j̶", "𝒿", "ɾ", "j͟", "𝕛", "ᴊ", "j"];
charArray["k̶"] = ["𝗸", "𝘬", "𝙠", "k̶", "𝓀", "ʞ", "k͟", "𝕜", "ᴋ", "k"];
charArray["l̶"] = ["𝗹", "𝘭", "𝙡", "l̶", "𝓁", "ן", "l͟", "𝕝", "ʟ", "l"];
charArray["m̶"] = ["𝗺", "𝘮", "𝙢", "m̶", "𝓂", "ɯ", "m͟", "𝕞", "ᴍ", "m"];
charArray["n̶"] = ["𝗻", "𝘯", "𝙣", "n̶", "𝓃", "u", "n͟", "𝕟", "ɴ", "n"];
charArray["o̶"] = ["𝗼", "𝘰", "𝙤", "o̶", "ℴ", "o", "o͟", "𝕠", "ᴏ", "o"];
charArray["p̶"] = ["𝗽", "𝘱", "𝙥", "p̶", "𝓅", "d", "p͟", "𝕡", "ᴘ", "p"];
charArray["q̶"] = ["𝗾", "𝘲", "𝙦", "q̶", "𝓆", "b", "q͟", "𝕢", "ǫ", "q"];
charArray["r̶"] = ["𝗿", "𝘳", "𝙧", "r̶", "𝓇", "ɹ", "r͟", "𝕣", "ʀ", "r"];
charArray["s̶"] = ["𝘀", "𝘴", "𝙨", "s̶", "𝓈", "s", "s͟", "𝕤", "s", "s"];
charArray["t̶"] = ["𝘁", "𝘵", "𝙩", "t̶", "𝓉", "ʇ", "t͟", "𝕥", "ᴛ", "t"];
charArray["u̶"] = ["𝘂", "𝘶", "𝙪", "u̶", "𝓊", "n", "u͟", "𝕦", "ᴜ", "u"];
charArray["v̶"] = ["𝘃", "𝘷", "𝙫", "v̶", "𝓋", "ʌ", "v͟", "𝕧", "ᴠ", "v"];
charArray["w̶"] = ["𝘄", "𝘸", "𝙬", "w̶", "𝓌", "ʍ", "w͟", "𝕨", "ᴡ", "w"];
charArray["x̶"] = ["𝘅", "𝘹", "𝙭", "x̶", "𝓍", "x", "x͟", "𝕩", "x", "x"];
charArray["y̶"] = ["𝘆", "𝘺", "𝙮", "y̶", "𝓎", "ʎ", "y͟", "𝕪", "ʏ", "y"];
charArray["z̶"] = ["𝘇", "𝘻", "𝙯", "z̶", "𝓏", "z", "z͟", "𝕫", "ᴢ", "z"];
charArray["1̶"] = ["𝟭", "1", "𝟭", "1̶", "1", "⇂", "1͟", "𝟙", "1", "1"];
charArray["2̶"] = ["𝟮", "2", "𝟮", "2̶", "2", "↊", "2͟", "𝟚", "2", "2"];
charArray["3̶"] = ["𝟯", "3", "𝟯", "3̶", "3", "↋", "3͟", "𝟛", "3", "3"];
charArray["4̶"] = ["𝟰", "4", "𝟰", "4̶", "4", "4", "4͟", "𝟜", "4", "4"];
charArray["5̶"] = ["𝟱", "5", "𝟱", "5̶", "5", "5", "5͟", "𝟝", "5", "5"];
charArray["6̶"] = ["𝟲", "6", "𝟲", "6̶", "6", "9", "6͟", "𝟞", "6", "6"];
charArray["7̶"] = ["𝟳", "7", "𝟳", "7̶", "7", "𝘓", "7͟", "𝟟", "7", "7"];
charArray["8̶"] = ["𝟴", "8", "𝟴", "8̶", "8", "8", "8͟", "𝟠", "8", "8"];
charArray["9̶"] = ["𝟵", "9", "𝟵", "9̶", "9", "6", "9͟", "𝟡", "9", "9"];
charArray["0̶"] = ["𝟬", "0", "𝟬", "0̶", "0", "0", "0͟", "𝟘", "0", "0"];

charArray["A͟"] = ["𝗔", "𝘈", "𝘼", "A̶", "𝒜", "∀", "A͟", "𝔸", "ᴀ", "A"];
charArray["B͟"] = ["𝗕", "𝘉", "𝘽", "B̶", "ℬ", "𐐒", "B͟", "𝔹", "ʙ", "B"];
charArray["C͟"] = ["𝗖", "𝘊", "𝘾", "C̶", "𝒞", "Ͻ", "C͟", "ℂ", "ᴄ", "C"];
charArray["D͟"] = ["𝗗", "𝘋", "𝘿", "D̶", "𝒟", "ᗡ", "D͟", "𝔻", "ᴅ", "D"];
charArray["E͟"] = ["𝗘", "𝘌", "𝙀", "E̶", "ℰ", "Ǝ", "E͟", "𝔼", "ᴇ", "E"];
charArray["F͟"] = ["𝗙", "𝘍", "𝙁", "F̶", "ℱ", "Ⅎ", "F͟", "𝔽", "ꜰ", "F"];
charArray["G͟"] = ["𝗚", "𝘎", "𝙂", "G̶", "𝒢", "⅁", "G͟", "𝔾", "ɢ", "G"];
charArray["H͟"] = ["𝗛", "𝘏", "𝙃", "H̶", "ℋ", "H", "H͟", "ℍ", "ʜ", "H"];
charArray["I͟"] = ["𝐈", "𝐼", "𝑰", "I̶", "ℐ", "I", "I͟", "𝕀", "ɪ", "I"];
charArray["J͟"] = ["𝗝", "𝘑", "𝙅", "J̶", "𝒥", "ſ", "J͟", "𝕁", "ᴊ", "J"];
charArray["K͟"] = ["𝗞", "𝘒", "𝙆", "K̶", "𝒦", "ꓘ", "K͟", "𝕂", "ᴋ", "K"];
charArray["L͟"] = ["𝗟", "𝘓", "𝙇", "L̶", "ℒ", "˥", "L͟", "𝕃", "ʟ", "L"];
charArray["M͟"] = ["𝗠", "𝘔", "𝙈", "M̶", "ℳ", "W", "M͟", "𝕄", "ᴍ", "M"];
charArray["N͟"] = ["𝗡", "𝘕", "𝙉", "N̶", "𝒩", "N", "N͟", "ℕ", "ɴ", "N"];
charArray["O͟"] = ["𝗢", "𝘖", "𝙊", "O̶", "𝒪", "O", "O͟", "𝕆", "ᴏ", "O"];
charArray["P͟"] = ["𝗣", "𝘗", "𝙋", "P̶", "𝒫", "Ԁ", "P͟", "ℙ", "ᴘ", "P"];
charArray["Q͟"] = ["𝗤", "𝘘", "𝙌", "Q̶", "𝒬", "Ὁ", "Q͟", "ℚ", "ǫ", "Q"];
charArray["R͟"] = ["𝗥", "𝘙", "𝙍", "R̶", "ℛ", "ᴚ", "R͟", "ℝ", "ʀ", "R"];
charArray["S͟"] = ["𝗦", "𝘚", "𝙎", "S̶", "𝒮", "S", "S͟", "𝕊", "s", "S"];
charArray["T͟"] = ["𝗧", "𝘛", "𝙏", "T̶", "𝒯", "⊥", "T͟", "𝕋", "ᴛ", "T"];
charArray["U͟"] = ["𝗨", "𝘜", "𝙐", "U̶", "𝒰", "∩", "U͟", "𝕌", "ᴜ", "U"];
charArray["V͟"] = ["𝗩", "𝘝", "𝙑", "V̶", "𝒱", "Λ", "V͟", "𝕍", "ᴠ", "V"];
charArray["W͟"] = ["𝗪", "𝘞", "𝙒", "W̶", "𝒲", "M", "W͟", "𝕎", "ᴡ", "W"];
charArray["X͟"] = ["𝗫", "𝘟", "𝙓", "X̶", "𝒳", "X", "X͟", "𝕏", "x", "X"];
charArray["Y͟"] = ["𝗬", "𝘠", "𝙔", "Y̶", "𝒴", "⅄", "Y͟", "𝕐", "ʏ", "Y"];
charArray["Z͟"] = ["𝗭", "𝘡", "𝙕", "Z̶", "𝒵", "Z", "Z͟", "ℤ", "ᴢ", "Z"];
charArray["a͟"] = ["𝗮", "𝘢", "𝙖", "a̶", "𝒶", "ɐ", "a͟", "𝕒", "ᴀ", "a"];
charArray["b͟"] = ["𝗯", "𝘣", "𝙗", "b̶", "𝒷", "q", "b͟", "𝕓", "ʙ", "b"];
charArray["c͟"] = ["𝗰", "𝘤", "𝙘", "c̶", "𝒸", "ɔ", "c͟", "𝕔", "ᴄ", "c"];
charArray["d͟"] = ["𝗱", "𝘥", "𝙙", "d̶", "𝒹", "p", "d͟", "𝕕", "ᴅ", "d"];
charArray["e͟"] = ["𝗲", "𝘦", "𝙚", "e̶", "ℯ", "ǝ", "e͟", "𝕖", "ᴇ", "e"];
charArray["f͟"] = ["𝗳", "𝘧", "𝙛", "f̶", "𝒻", "ɟ", "f͟", "𝕗", "ꜰ", "f"];
charArray["g͟"] = ["𝗴", "𝘨", "𝙜", "g̶", "ℊ", "ƃ", "g͟", "𝕘", "ɢ", "g"];
charArray["h͟"] = ["𝗵", "𝘩", "𝙝", "h̶", "𝒽", "ɥ", "h͟", "𝕙", "ʜ", "h"];
charArray["i͟"] = ["𝗶", "𝘪", "𝙞", "i̶", "𝒾", "ı", "i͟", "𝕚", "ɪ", "i"];
charArray["j͟"] = ["𝗷", "𝘫", "𝙟", "j̶", "𝒿", "ɾ", "j͟", "𝕛", "ᴊ", "j"];
charArray["k͟"] = ["𝗸", "𝘬", "𝙠", "k̶", "𝓀", "ʞ", "k͟", "𝕜", "ᴋ", "k"];
charArray["l͟"] = ["𝗹", "𝘭", "𝙡", "l̶", "𝓁", "ן", "l͟", "𝕝", "ʟ", "l"];
charArray["m͟"] = ["𝗺", "𝘮", "𝙢", "m̶", "𝓂", "ɯ", "m͟", "𝕞", "ᴍ", "m"];
charArray["n͟"] = ["𝗻", "𝘯", "𝙣", "n̶", "𝓃", "u", "n͟", "𝕟", "ɴ", "n"];
charArray["o͟"] = ["𝗼", "𝘰", "𝙤", "o̶", "ℴ", "o", "o͟", "𝕠", "ᴏ", "o"];
charArray["p͟"] = ["𝗽", "𝘱", "𝙥", "p̶", "𝓅", "d", "p͟", "𝕡", "ᴘ", "p"];
charArray["q͟"] = ["𝗾", "𝘲", "𝙦", "q̶", "𝓆", "b", "q͟", "𝕢", "ǫ", "q"];
charArray["r͟"] = ["𝗿", "𝘳", "𝙧", "r̶", "𝓇", "ɹ", "r͟", "𝕣", "ʀ", "r"];
charArray["s͟"] = ["𝘀", "𝘴", "𝙨", "s̶", "𝓈", "s", "s͟", "𝕤", "s", "s"];
charArray["t͟"] = ["𝘁", "𝘵", "𝙩", "t̶", "𝓉", "ʇ", "t͟", "𝕥", "ᴛ", "t"];
charArray["u͟"] = ["𝘂", "𝘶", "𝙪", "u̶", "𝓊", "n", "u͟", "𝕦", "ᴜ", "u"];
charArray["v͟"] = ["𝘃", "𝘷", "𝙫", "v̶", "𝓋", "ʌ", "v͟", "𝕧", "ᴠ", "v"];
charArray["w͟"] = ["𝘄", "𝘸", "𝙬", "w̶", "𝓌", "ʍ", "w͟", "𝕨", "ᴡ", "w"];
charArray["x͟"] = ["𝘅", "𝘹", "𝙭", "x̶", "𝓍", "x", "x͟", "𝕩", "x", "x"];
charArray["y͟"] = ["𝘆", "𝘺", "𝙮", "y̶", "𝓎", "ʎ", "y͟", "𝕪", "ʏ", "y"];
charArray["z͟"] = ["𝘇", "𝘻", "𝙯", "z̶", "𝓏", "z", "z͟", "𝕫", "ᴢ", "z"];
charArray["1͟"] = ["𝟭", "1", "𝟭", "1̶", "1", "⇂", "1͟", "𝟙", "1", "1"];
charArray["2͟"] = ["𝟮", "2", "𝟮", "2̶", "2", "↊", "2͟", "𝟚", "2", "2"];
charArray["3͟"] = ["𝟯", "3", "𝟯", "3̶", "3", "↋", "3͟", "𝟛", "3", "3"];
charArray["4͟"] = ["𝟰", "4", "𝟰", "4̶", "4", "4", "4͟", "𝟜", "4", "4"];
charArray["5͟"] = ["𝟱", "5", "𝟱", "5̶", "5", "5", "5͟", "𝟝", "5", "5"];
charArray["6͟"] = ["𝟲", "6", "𝟲", "6̶", "6", "9", "6͟", "𝟞", "6", "6"];
charArray["7͟"] = ["𝟳", "7", "𝟳", "7̶", "7", "𝘓", "7͟", "𝟟", "7", "7"];
charArray["8͟"] = ["𝟴", "8", "𝟴", "8̶", "8", "8", "8͟", "𝟠", "8", "8"];
charArray["9͟"] = ["𝟵", "9", "𝟵", "9̶", "9", "6", "9͟", "𝟡", "9", "9"];
charArray["0͟"] = ["𝟬", "0", "𝟬", "0̶", "0", "0", "0͟", "𝟘", "0", "0"];

charArray["𝒜"] = ["𝗔", "𝘈", "𝘼", "A̶", "𝒜", "∀", "A͟", "𝔸", "ᴀ", "A"];
charArray["ℬ"] = ["𝗕", "𝘉", "𝘽", "B̶", "ℬ", "𐐒", "B͟", "𝔹", "ʙ", "B"];
charArray["𝒞"] = ["𝗖", "𝘊", "𝘾", "C̶", "𝒞", "Ͻ", "C͟", "ℂ", "ᴄ", "C"];
charArray["𝒟"] = ["𝗗", "𝘋", "𝘿", "D̶", "𝒟", "ᗡ", "D͟", "𝔻", "ᴅ", "D"];
charArray["ℰ"] = ["𝗘", "𝘌", "𝙀", "E̶", "ℰ", "Ǝ", "E͟", "𝔼", "ᴇ", "E"];
charArray["ℱ"] = ["𝗙", "𝘍", "𝙁", "F̶", "ℱ", "Ⅎ", "F͟", "𝔽", "ꜰ", "F"];
charArray["𝒢"] = ["𝗚", "𝘎", "𝙂", "G̶", "𝒢", "⅁", "G͟", "𝔾", "ɢ", "G"];
charArray["ℋ"] = ["𝗛", "𝘏", "𝙃", "H̶", "ℋ", "H", "H͟", "ℍ", "ʜ", "H"];
charArray["ℐ"] = ["𝐈", "𝐼", "𝑰", "I̶", "ℐ", "I", "I͟", "𝕀", "ɪ", "I"];
charArray["𝒥"] = ["𝗝", "𝘑", "𝙅", "J̶", "𝒥", "ſ", "J͟", "𝕁", "ᴊ", "J"];
charArray["𝒦"] = ["𝗞", "𝘒", "𝙆", "K̶", "𝒦", "ꓘ", "K͟", "𝕂", "ᴋ", "K"];
charArray["ℒ"] = ["𝗟", "𝘓", "𝙇", "L̶", "ℒ", "˥", "L͟", "𝕃", "ʟ", "L"];
charArray["ℳ"] = ["𝗠", "𝘔", "𝙈", "M̶", "ℳ", "W", "M͟", "𝕄", "ᴍ", "M"];
charArray["𝒩"] = ["𝗡", "𝘕", "𝙉", "N̶", "𝒩", "N", "N͟", "ℕ", "ɴ", "N"];
charArray["𝒪"] = ["𝗢", "𝘖", "𝙊", "O̶", "𝒪", "O", "O͟", "𝕆", "ᴏ", "O"];
charArray["𝒫"] = ["𝗣", "𝘗", "𝙋", "P̶", "𝒫", "Ԁ", "P͟", "ℙ", "ᴘ", "P"];
charArray["𝒬"] = ["𝗤", "𝘘", "𝙌", "Q̶", "𝒬", "Ὁ", "Q͟", "ℚ", "ǫ", "Q"];
charArray["ℛ"] = ["𝗥", "𝘙", "𝙍", "R̶", "ℛ", "ᴚ", "R͟", "ℝ", "ʀ", "R"];
charArray["𝒮"] = ["𝗦", "𝘚", "𝙎", "S̶", "𝒮", "S", "S͟", "𝕊", "s", "S"];
charArray["𝒯"] = ["𝗧", "𝘛", "𝙏", "T̶", "𝒯", "⊥", "T͟", "𝕋", "ᴛ", "T"];
charArray["𝒰"] = ["𝗨", "𝘜", "𝙐", "U̶", "𝒰", "∩", "U͟", "𝕌", "ᴜ", "U"];
charArray["𝒱"] = ["𝗩", "𝘝", "𝙑", "V̶", "𝒱", "Λ", "V͟", "𝕍", "ᴠ", "V"];
charArray["𝒲"] = ["𝗪", "𝘞", "𝙒", "W̶", "𝒲", "M", "W͟", "𝕎", "ᴡ", "W"];
charArray["𝒳"] = ["𝗫", "𝘟", "𝙓", "X̶", "𝒳", "X", "X͟", "𝕏", "x", "X"];
charArray["𝒴"] = ["𝗬", "𝘠", "𝙔", "Y̶", "𝒴", "⅄", "Y͟", "𝕐", "ʏ", "Y"];
charArray["𝒵"] = ["𝗭", "𝘡", "𝙕", "Z̶", "𝒵", "Z", "Z͟", "ℤ", "ᴢ", "Z"];
charArray["𝒶"] = ["𝗮", "𝘢", "𝙖", "a̶", "𝒶", "ɐ", "a͟", "𝕒", "ᴀ", "a"];
charArray["𝒷"] = ["𝗯", "𝘣", "𝙗", "b̶", "𝒷", "q", "b͟", "𝕓", "ʙ", "b"];
charArray["𝒸"] = ["𝗰", "𝘤", "𝙘", "c̶", "𝒸", "ɔ", "c͟", "𝕔", "ᴄ", "c"];
charArray["𝒹"] = ["𝗱", "𝘥", "𝙙", "d̶", "𝒹", "p", "d͟", "𝕕", "ᴅ", "d"];
charArray["ℯ"] = ["𝗲", "𝘦", "𝙚", "e̶", "ℯ", "ǝ", "e͟", "𝕖", "ᴇ", "e"];
charArray["𝒻"] = ["𝗳", "𝘧", "𝙛", "f̶", "𝒻", "ɟ", "f͟", "𝕗", "ꜰ", "f"];
charArray["ℊ"] = ["𝗴", "𝘨", "𝙜", "g̶", "ℊ", "ƃ", "g͟", "𝕘", "ɢ", "g"];
charArray["𝒽"] = ["𝗵", "𝘩", "𝙝", "h̶", "𝒽", "ɥ", "h͟", "𝕙", "ʜ", "h"];
charArray["𝒾"] = ["𝗶", "𝘪", "𝙞", "i̶", "𝒾", "ı", "i͟", "𝕚", "ɪ", "i"];
charArray["𝒿"] = ["𝗷", "𝘫", "𝙟", "j̶", "𝒿", "ɾ", "j͟", "𝕛", "ᴊ", "j"];
charArray["𝓀"] = ["𝗸", "𝘬", "𝙠", "k̶", "𝓀", "ʞ", "k͟", "𝕜", "ᴋ", "k"];
charArray["𝓁"] = ["𝗹", "𝘭", "𝙡", "l̶", "𝓁", "ן", "l͟", "𝕝", "ʟ", "l"];
charArray["𝓂"] = ["𝗺", "𝘮", "𝙢", "m̶", "𝓂", "ɯ", "m͟", "𝕞", "ᴍ", "m"];
charArray["𝓃"] = ["𝗻", "𝘯", "𝙣", "n̶", "𝓃", "u", "n͟", "𝕟", "ɴ", "n"];
charArray["ℴ"] = ["𝗼", "𝘰", "𝙤", "o̶", "ℴ", "o", "o͟", "𝕠", "ᴏ", "o"];
charArray["𝓅"] = ["𝗽", "𝘱", "𝙥", "p̶", "𝓅", "d", "p͟", "𝕡", "ᴘ", "p"];
charArray["𝓆"] = ["𝗾", "𝘲", "𝙦", "q̶", "𝓆", "b", "q͟", "𝕢", "ǫ", "q"];
charArray["𝓇"] = ["𝗿", "𝘳", "𝙧", "r̶", "𝓇", "ɹ", "r͟", "𝕣", "ʀ", "r"];
charArray["𝓈"] = ["𝘀", "𝘴", "𝙨", "s̶", "𝓈", "s", "s͟", "𝕤", "s", "s"];
charArray["𝓉"] = ["𝘁", "𝘵", "𝙩", "t̶", "𝓉", "ʇ", "t͟", "𝕥", "ᴛ", "t"];
charArray["𝓊"] = ["𝘂", "𝘶", "𝙪", "u̶", "𝓊", "n", "u͟", "𝕦", "ᴜ", "u"];
charArray["𝓋"] = ["𝘃", "𝘷", "𝙫", "v̶", "𝓋", "ʌ", "v͟", "𝕧", "ᴠ", "v"];
charArray["𝓌"] = ["𝘄", "𝘸", "𝙬", "w̶", "𝓌", "ʍ", "w͟", "𝕨", "ᴡ", "w"];
charArray["𝓍"] = ["𝘅", "𝘹", "𝙭", "x̶", "𝓍", "x", "x͟", "𝕩", "x", "x"];
charArray["𝓎"] = ["𝘆", "𝘺", "𝙮", "y̶", "𝓎", "ʎ", "y͟", "𝕪", "ʏ", "y"];
charArray["𝓕"] = ["𝘇", "𝘻", "𝙯", "z̶", "𝓏", "z", "z͟", "𝕫", "ᴢ", "z"];

charArray["∀"] = ["𝗔", "𝘈", "𝘼", "A̶", "𝒜", "∀", "A͟", "𝔸", "ᴀ", "A"];
charArray["𐐒"] = ["𝗕", "𝘉", "𝘽", "B̶", "ℬ", "𐐒", "B͟", "𝔹", "ʙ", "B"];
charArray["Ͻ"] = ["𝗖", "𝘊", "𝘾", "C̶", "𝒞", "Ͻ", "C͟", "ℂ", "ᴄ", "C"];
charArray["ᗡ"] = ["𝗗", "𝘋", "𝘿", "D̶", "𝒟", "ᗡ", "D͟", "𝔻", "ᴅ", "D"];
charArray["Ǝ"] = ["𝗘", "𝘌", "𝙀", "E̶", "ℰ", "Ǝ", "E͟", "𝔼", "ᴇ", "E"];
charArray["Ⅎ"] = ["𝗙", "𝘍", "𝙁", "F̶", "ℱ", "Ⅎ", "F͟", "𝔽", "ꜰ", "F"];
charArray["⅁"] = ["𝗚", "𝘎", "𝙂", "G̶", "𝒢", "⅁", "G͟", "𝔾", "ɢ", "G"];
charArray["ſ"] = ["𝗝", "𝘑", "𝙅", "J̶", "𝒥", "ſ", "J͟", "𝕁", "ᴊ", "J"];
charArray["ꓘ"] = ["𝗞", "𝘒", "𝙆", "K̶", "𝒦", "ꓘ", "K͟", "𝕂", "ᴋ", "K"];
charArray["˥"] = ["𝗟", "𝘓", "𝙇", "L̶", "ℒ", "˥", "L͟", "𝕃", "ʟ", "L"];
charArray["Ԁ"] = ["𝗣", "𝘗", "𝙋", "P̶", "𝒫", "Ԁ", "P͟", "ℙ", "ᴘ", "P"];
charArray["Ὁ"] = ["𝗤", "𝘘", "𝙌", "Q̶", "𝒬", "Ὁ", "Q͟", "ℚ", "ǫ", "Q"];
charArray["ᴚ"] = ["𝗥", "𝘙", "𝙍", "R̶", "ℛ", "ᴚ", "R͟", "ℝ", "ʀ", "R"];
charArray["⊥"] = ["𝗧", "𝘛", "𝙏", "T̶", "𝒯", "⊥", "T͟", "𝕋", "ᴛ", "T"];
charArray["∩"] = ["𝗨", "𝘜", "𝙐", "U̶", "𝒰", "∩", "U͟", "𝕌", "ᴜ", "U"];
charArray["Λ"] = ["𝗩", "𝘝", "𝙑", "V̶", "𝒱", "Λ", "V͟", "𝕍", "ᴠ", "V"];
charArray["⅄"] = ["𝗬", "𝘠", "𝙔", "Y̶", "𝒴", "⅄", "Y͟", "𝕐", "ʏ", "Y"];
charArray["ɐ"] = ["𝗮", "𝘢", "𝙖", "a̶", "𝒶", "ɐ", "a͟", "𝕒", "ᴀ", "a"];
charArray["ɔ"] = ["𝗰", "𝘤", "𝙘", "c̶", "𝒸", "ɔ", "c͟", "𝕔", "ᴄ", "c"];
charArray["ǝ"] = ["𝗲", "𝘦", "𝙚", "e̶", "ℯ", "ǝ", "e͟", "𝕖", "ᴇ", "e"];
charArray["ɟ"] = ["𝗳", "𝘧", "𝙛", "f̶", "𝒻", "ɟ", "f͟", "𝕗", "ꜰ", "f"];
charArray["ƃ"] = ["𝗴", "𝘨", "𝙜", "g̶", "ℊ", "ƃ", "g͟", "𝕘", "ɢ", "g"];
charArray["ɥ"] = ["𝗵", "𝘩", "𝙝", "h̶", "𝒽", "ɥ", "h͟", "𝕙", "ʜ", "h"];
charArray["ı"] = ["𝗶", "𝘪", "𝙞", "i̶", "𝒾", "ı", "i͟", "𝕚", "ɪ", "i"];
charArray["ɾ"] = ["𝗷", "𝘫", "𝙟", "j̶", "𝒿", "ɾ", "j͟", "𝕛", "ᴊ", "j"];
charArray["ʞ"] = ["𝗸", "𝘬", "𝙠", "k̶", "𝓀", "ʞ", "k͟", "𝕜", "ᴋ", "k"];
charArray["ן"] = ["𝗹", "𝘭", "𝙡", "l̶", "𝓁", "ן", "l͟", "𝕝", "ʟ", "l"];
charArray["ɯ"] = ["𝗺", "𝘮", "𝙢", "m̶", "𝓂", "ɯ", "m͟", "𝕞", "ᴍ", "m"];
charArray["u"] = ["𝗻", "𝘯", "𝙣", "n̶", "𝓃", "u", "n͟", "𝕟", "ɴ", "n"];
charArray["ɹ"] = ["𝗿", "𝘳", "𝙧", "r̶", "𝓇", "ɹ", "r͟", "𝕣", "ʀ", "r"];
charArray["ʇ"] = ["𝘁", "𝘵", "𝙩", "t̶", "𝓉", "ʇ", "t͟", "𝕥", "ᴛ", "t"];
charArray["ʌ"] = ["𝘃", "𝘷", "𝙫", "v̶", "𝓋", "ʌ", "v͟", "𝕧", "ᴠ", "v"];
charArray["ʍ"] = ["𝘄", "𝘸", "𝙬", "w̶", "𝓌", "ʍ", "w͟", "𝕨", "ᴡ", "w"];
charArray["ʎ"] = ["𝘆", "𝘺", "𝙮", "y̶", "𝓎", "ʎ", "y͟", "𝕪", "ʏ", "y"];
charArray["⇂"] = ["𝟭", "1", "𝟭", "1̶", "1", "⇂", "1͟", "𝟙", "1", "1"];
charArray["↊"] = ["𝟮", "2", "𝟮", "2̶", "2", "↊", "2͟", "𝟚", "2", "2"];
charArray["↋"] = ["𝟯", "3", "𝟯", "3̶", "3", "↋", "3͟", "𝟛", "3", "3"];
charArray["5"] = ["𝟱", "5", "𝟱", "5̶", "5", "5", "5͟", "𝟝", "5", "5"];
charArray["𝘓"] = ["𝟳", "7", "𝟳", "7̶", "7", "𝘓", "7͟", "𝟟", "7", "7"];

charArray["𝔸"] = ["𝗔", "𝘈", "𝘼", "A̶", "𝒜", "∀", "A͟", "𝔸", "ᴀ", "A"];
charArray["𝔹"] = ["𝗕", "𝘉", "𝘽", "B̶", "ℬ", "𐐒", "B͟", "𝔹", "ʙ", "B"];
charArray["ℂ"] = ["𝗖", "𝘊", "𝘾", "C̶", "𝒞", "Ͻ", "C͟", "ℂ", "ᴄ", "C"];
charArray["𝔻"] = ["𝗗", "𝘋", "𝘿", "D̶", "𝒟", "ᗡ", "D͟", "𝔻", "ᴅ", "D"];
charArray["𝔼"] = ["𝗘", "𝘌", "𝙀", "E̶", "ℰ", "Ǝ", "E͟", "𝔼", "ᴇ", "E"];
charArray["𝔽"] = ["𝗙", "𝘍", "𝙁", "F̶", "ℱ", "Ⅎ", "F͟", "𝔽", "ꜰ", "F"];
charArray["𝔾"] = ["𝗚", "𝘎", "𝙂", "G̶", "𝒢", "⅁", "G͟", "𝔾", "ɢ", "G"];
charArray["ℍ"] = ["𝗛", "𝘏", "𝙃", "H̶", "ℋ", "H", "H͟", "ℍ", "ʜ", "H"];
charArray["𝕀"] = ["𝐈", "𝐼", "𝑰", "I̶", "ℐ", "I", "I͟", "𝕀", "ɪ", "I"];
charArray["𝕁"] = ["𝗝", "𝘑", "𝙅", "J̶", "𝒥", "ſ", "J͟", "𝕁", "ᴊ", "J"];
charArray["𝕂"] = ["𝗞", "𝘒", "𝙆", "K̶", "𝒦", "ꓘ", "K͟", "𝕂", "ᴋ", "K"];
charArray["𝕃"] = ["𝗟", "𝘓", "𝙇", "L̶", "ℒ", "˥", "L͟", "𝕃", "ʟ", "L"];
charArray["𝕄"] = ["𝗠", "𝘔", "𝙈", "M̶", "ℳ", "W", "M͟", "𝕄", "ᴍ", "M"];
charArray["ℕ"] = ["𝗡", "𝘕", "𝙉", "N̶", "𝒩", "N", "N͟", "ℕ", "ɴ", "N"];
charArray["𝕆"] = ["𝗢", "𝘖", "𝙊", "O̶", "𝒪", "O", "O͟", "𝕆", "ᴏ", "O"];
charArray["ℙ"] = ["𝗣", "𝘗", "𝙋", "P̶", "𝒫", "Ԁ", "P͟", "ℙ", "ᴘ", "P"];
charArray["ℚ"] = ["𝗤", "𝘘", "𝙌", "Q̶", "𝒬", "Ὁ", "Q͟", "ℚ", "ǫ", "Q"];
charArray["ℝ"] = ["𝗥", "𝘙", "𝙍", "R̶", "ℛ", "ᴚ", "R͟", "ℝ", "ʀ", "R"];
charArray["𝕊"] = ["𝗦", "𝘚", "𝙎", "S̶", "𝒮", "S", "S͟", "𝕊", "s", "S"];
charArray["𝕋"] = ["𝗧", "𝘛", "𝙏", "T̶", "𝒯", "⊥", "T͟", "𝕋", "ᴛ", "T"];
charArray["𝕌"] = ["𝗨", "𝘜", "𝙐", "U̶", "𝒰", "∩", "U͟", "𝕌", "ᴜ", "U"];
charArray["𝕍"] = ["𝗩", "𝘝", "𝙑", "V̶", "𝒱", "Λ", "V͟", "𝕍", "ᴠ", "V"];
charArray["𝕎"] = ["𝗪", "𝘞", "𝙒", "W̶", "𝒲", "M", "W͟", "𝕎", "ᴡ", "W"];
charArray["𝕏"] = ["𝗫", "𝘟", "𝙓", "X̶", "𝒳", "X", "X͟", "𝕏", "x", "X"];
charArray["𝕐"] = ["𝗬", "𝘠", "𝙔", "Y̶", "𝒴", "⅄", "Y͟", "𝕐", "ʏ", "Y"];
charArray["ℤ"] = ["𝗭", "𝘡", "𝙕", "Z̶", "𝒵", "Z", "Z͟", "ℤ", "ᴢ", "Z"];
charArray["𝕒"] = ["𝗮", "𝘢", "𝙖", "a̶", "𝒶", "ɐ", "a͟", "𝕒", "ᴀ", "a"];
charArray["𝕓"] = ["𝗯", "𝘣", "𝙗", "b̶", "𝒷", "q", "b͟", "𝕓", "ʙ", "b"];
charArray["𝕔"] = ["𝗰", "𝘤", "𝙘", "c̶", "𝒸", "ɔ", "c͟", "𝕔", "ᴄ", "c"];
charArray["𝕕"] = ["𝗱", "𝘥", "𝙙", "d̶", "𝒹", "p", "d͟", "𝕕", "ᴅ", "d"];
charArray["𝕖"] = ["𝗲", "𝘦", "𝙚", "e̶", "ℯ", "ǝ", "e͟", "𝕖", "ᴇ", "e"];
charArray["𝕗"] = ["𝗳", "𝘧", "𝙛", "f̶", "𝒻", "ɟ", "f͟", "𝕗", "ꜰ", "f"];
charArray["𝕘"] = ["𝗴", "𝘨", "𝙜", "g̶", "ℊ", "ƃ", "g͟", "𝕘", "ɢ", "g"];
charArray["𝕙"] = ["𝗵", "𝘩", "𝙝", "h̶", "𝒽", "ɥ", "h͟", "𝕙", "ʜ", "h"];
charArray["𝕚"] = ["𝗶", "𝘪", "𝙞", "i̶", "𝒾", "ı", "i͟", "𝕚", "ɪ", "i"];
charArray["𝕛"] = ["𝗷", "𝘫", "𝙟", "j̶", "𝒿", "ɾ", "j͟", "𝕛", "ᴊ", "j"];
charArray["𝕜"] = ["𝗸", "𝘬", "𝙠", "k̶", "𝓀", "ʞ", "k͟", "𝕜", "ᴋ", "k"];
charArray["𝕝"] = ["𝗹", "𝘭", "𝙡", "l̶", "𝓁", "ן", "l͟", "𝕝", "ʟ", "l"];
charArray["𝕞"] = ["𝗺", "𝘮", "𝙢", "m̶", "𝓂", "ɯ", "m͟", "𝕞", "ᴍ", "m"];
charArray["𝕟"] = ["𝗻", "𝘯", "𝙣", "n̶", "𝓃", "u", "n͟", "𝕟", "ɴ", "n"];
charArray["𝕠"] = ["𝗼", "𝘰", "𝙤", "o̶", "ℴ", "o", "o͟", "𝕠", "ᴏ", "o"];
charArray["𝕡"] = ["𝗽", "𝘱", "𝙥", "p̶", "𝓅", "d", "p͟", "𝕡", "ᴘ", "p"];
charArray["𝕢"] = ["𝗾", "𝘲", "𝙦", "q̶", "𝓆", "b", "q͟", "𝕢", "ǫ", "q"];
charArray["𝕣"] = ["𝗿", "𝘳", "𝙧", "r̶", "𝓇", "ɹ", "r͟", "𝕣", "ʀ", "r"];
charArray["𝕤"] = ["𝘀", "𝘴", "𝙨", "s̶", "𝓈", "s", "s͟", "𝕤", "s", "s"];
charArray["𝕥"] = ["𝘁", "𝘵", "𝙩", "t̶", "𝓉", "ʇ", "t͟", "𝕥", "ᴛ", "t"];
charArray["𝕦"] = ["𝘂", "𝘶", "𝙪", "u̶", "𝓊", "n", "u͟", "𝕦", "ᴜ", "u"];
charArray["𝕧"] = ["𝘃", "𝘷", "𝙫", "v̶", "𝓋", "ʌ", "v͟", "𝕧", "ᴠ", "v"];
charArray["𝕨"] = ["𝘄", "𝘸", "𝙬", "w̶", "𝓌", "ʍ", "w͟", "𝕨", "ᴡ", "w"];
charArray["𝕩"] = ["𝘅", "𝘹", "𝙭", "x̶", "𝓍", "x", "x͟", "𝕩", "x", "x"];
charArray["𝕪"] = ["𝘆", "𝘺", "𝙮", "y̶", "𝓎", "ʎ", "y͟", "𝕪", "ʏ", "y"];
charArray["𝕫"] = ["𝘇", "𝘻", "𝙯", "z̶", "𝓏", "z", "z͟", "𝕫", "ᴢ", "z"];
charArray["𝟙"] = ["𝟭", "1", "𝟭", "1̶", "1", "⇂", "1͟", "𝟙", "1", "1"];
charArray["𝟚"] = ["𝟮", "2", "𝟮", "2̶", "2", "↊", "2͟", "𝟚", "2", "2"];
charArray["𝟛"] = ["𝟯", "3", "𝟯", "3̶", "3", "↋", "3͟", "𝟛", "3", "3"];
charArray["𝟜"] = ["𝟰", "4", "𝟰", "4̶", "4", "4", "4͟", "𝟜", "4", "4"];
charArray["𝟝"] = ["𝟱", "5", "𝟱", "5̶", "5", "5", "5͟", "𝟝", "5", "5"];
charArray["𝟞"] = ["𝟲", "6", "𝟲", "6̶", "6", "9", "6͟", "𝟞", "6", "6"];
charArray["𝟟"] = ["𝟳", "7", "𝟳", "7̶", "7", "𝘓", "7͟", "𝟟", "7", "7"];
charArray["𝟠"] = ["𝟴", "8", "𝟴", "8̶", "8", "8", "8͟", "𝟠", "8", "8"];
charArray["𝟡"] = ["𝟵", "9", "𝟵", "9̶", "9", "6", "9͟", "𝟡", "9", "9"];
charArray["𝟘"] = ["𝟬", "0", "𝟬", "0̶", "0", "0", "0͟", "𝟘", "0", "0"];

charArray["ᴀ"] = ["𝗮", "𝘢", "𝙖", "a̶", "𝒶", "ɐ", "a͟", "𝕒", "ᴀ", "a"];
charArray["ʙ"] = ["𝗯", "𝘣", "𝙗", "b̶", "𝒷", "q", "b͟", "𝕓", "ʙ", "b"];
charArray["ᴄ"] = ["𝗰", "𝘤", "𝙘", "c̶", "𝒸", "ɔ", "c͟", "𝕔", "ᴄ", "c"];
charArray["ᴅ"] = ["𝗱", "𝘥", "𝙙", "d̶", "𝒹", "p", "d͟", "𝕕", "ᴅ", "d"];
charArray["ᴇ"] = ["𝗲", "𝘦", "𝙚", "e̶", "ℯ", "ǝ", "e͟", "𝕖", "ᴇ", "e"];
charArray["ꜰ"] = ["𝗳", "𝘧", "𝙛", "f̶", "𝒻", "ɟ", "f͟", "𝕗", "ꜰ", "f"];
charArray["ɢ"] = ["𝗴", "𝘨", "𝙜", "g̶", "ℊ", "ƃ", "g͟", "𝕘", "ɢ", "g"];
charArray["ʜ"] = ["𝗵", "𝘩", "𝙝", "h̶", "𝒽", "ɥ", "h͟", "𝕙", "ʜ", "h"];
charArray["ɪ"] = ["𝗶", "𝘪", "𝙞", "i̶", "𝒾", "ı", "i͟", "𝕚", "ɪ", "i"];
charArray["ᴊ"] = ["𝗷", "𝘫", "𝙟", "j̶", "𝒿", "ɾ", "j͟", "𝕛", "ᴊ", "j"];
charArray["ᴋ"] = ["𝗸", "𝘬", "𝙠", "k̶", "𝓀", "ʞ", "k͟", "𝕜", "ᴋ", "k"];
charArray["ʟ"] = ["𝗹", "𝘭", "𝙡", "l̶", "𝓁", "ן", "l͟", "𝕝", "ʟ", "l"];
charArray["ᴍ"] = ["𝗺", "𝘮", "𝙢", "m̶", "𝓂", "ɯ", "m͟", "𝕞", "ᴍ", "m"];
charArray["ɴ"] = ["𝗻", "𝘯", "𝙣", "n̶", "𝓃", "u", "n͟", "𝕟", "ɴ", "n"];
charArray["ᴏ"] = ["𝗼", "𝘰", "𝙤", "o̶", "ℴ", "o", "o͟", "𝕠", "ᴏ", "o"];
charArray["ᴘ"] = ["𝗽", "𝘱", "𝙥", "p̶", "𝓅", "d", "p͟", "𝕡", "ᴘ", "p"];
charArray["ǫ"] = ["𝗾", "𝘲", "𝙦", "q̶", "𝓆", "b", "q͟", "𝕢", "ǫ", "q"];
charArray["ʀ"] = ["𝗿", "𝘳", "𝙧", "r̶", "𝓇", "ɹ", "r͟", "𝕣", "ʀ", "r"];
charArray["ᴛ"] = ["𝘁", "𝘵", "𝙩", "t̶", "𝓉", "ʇ", "t͟", "𝕥", "ᴛ", "t"];
charArray["ᴜ"] = ["𝘂", "𝘶", "𝙪", "u̶", "𝓊", "n", "u͟", "𝕦", "ᴜ", "u"];
charArray["ᴠ"] = ["𝘃", "𝘷", "𝙫", "v̶", "𝓋", "ʌ", "v͟", "𝕧", "ᴠ", "v"];
charArray["ᴡ"] = ["𝘄", "𝘸", "𝙬", "w̶", "𝓌", "ʍ", "w͟", "𝕨", "ᴡ", "w"];
charArray["ʏ"] = ["𝘆", "𝘺", "𝙮", "y̶", "𝓎", "ʎ", "y͟", "𝕪", "ʏ", "y"];
charArray["ᴢ"] = ["𝘇", "𝘻", "𝙯", "z̶", "𝓏", "z", "z͟", "𝕫", "ᴢ", "z"];


const reformatIt = (theText, textType) => {
  console.log(theText, "hello world");
  var theText = [...theText]
  console.log(theText)
  var c = "";
  var reformatted = "";
  for (var x = 0; x < theText.length; x++) {
    c = theText[x]
    console.log("reformating", c);
    if (c in charArray) {
      console.log("reformated single text", charArray[c][textType]);
      reformatted += charArray[c][textType];
    } else {
      reformatted += c;
    }
    console.log("reformated text joining", reformatted);
  }
  console.log("reformated word done", reformatted);

  console.log("pasted");
  return reformatted;
};